Repository: GamemakerChina/GMS2_manual_en2ch
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: These files are much smaller than a WAV file and but do have a CPU overhead associated with them as they have to be decoded before being played.
zh_cn: 这两种格式的文件储存同样的内容时远小于 WAV 格式文件，但是他们需要一定的计算资源来在播放前进行解码。

source: These files can be anything from text documents to images, to zipped files and can be accessed using the various File Functions, following the rules defined by the File System.
zh_cn: 这些文件可以是从文本文档，图像，到压缩文件，以及可以使用各种 文件函数 进行访问，遵循 文件系统 定义规则的文件。

source: These functions are explained on the following pages:
zh_cn: 下面的网页将详细介绍这些函数：

source: These functions are:
zh_cn: 这些函数是：

source: These options are:
zh_cn: 这些选项是：

source: These options include source control integration, project configurations, advanced debugging and a number of extra tools for changing and manipulating the game assets (please note that the availability of some of these advanced tools will depend on the version of GameMaker Studio 2 that you currently use).
zh_cn: 这些选项包括源代码控制集成，项目配置，先进的调试，以及更改和操作资源的额外工具（请注意这些高级工具的可用于取决于当前使用 版本 的GameMaker Studio 2）。

source: These pages are designed to be informative and help the user understand some of the concepts behind programming in general as well as how to get the most from GameMaker Studio 2, and as such it is recommended that you have some experience using the product before reading.
zh_cn: 这些页面被设计为资料性质，帮助用户理解一般编程背后的一些概念，以及更深刻的理解 GameMaker Studio 2，为此建议你有一些使用这个产品的经验之后再来阅读。

source: These preferences are used to set the behaviour of the code/script editor, with the following options available:
zh_cn: 这些偏好设置用于设置代码/脚本编辑器的行为，并提供以下选项：

source: These settings can be changed here:
zh_cn: 能够在这里被修改的设定有：

source: These tools are mainly the different runners and compilers that each platform requires, and you can actually have several of each at any one time.
zh_cn: 这些工具主要是不同平台要求的运行器和编译器，并且实际上你能同时拥有多个这些东西。

source: These values represent the following:
zh_cn: 这些值所表示内容如下：

source: These variables cannot be edited (neither their name nor their path/setting) but you can select and copy/paste any of them for use elsewhere.
zh_cn: 这些变量不能被编辑（名字和路径/设定都不可以），但是你可以选取复制它们并可以将其粘贴到别的地方以供使用。

source: These will be detected as you add your DnD™ actions or code and are shown in the Syntax Errors Output Window, similar to the image shown below:
zh_cn: 当您添加 DnD™ 操作或代码时，将会检测到这些操作，并显示在 语法错误输出窗口 中，与下图所示相似：

source: They also have a series of built-in variables that can then be used in actions, scripts and code.
zh_cn: 他们还具有一系列内置变量，可以在动作模块，脚本以及代码中使用。

source: They are designed as a place to keep code snippets, game information, to-do lists, team communications, etc...
zh_cn: 它被设计为保留代码片段，游戏信息，待办事项列表，团队沟通等的地方...

source: They are great for designing any static items in your room, like terrain, walls, backdrops, etc... as they don't have the same overhead that objects have.
zh_cn: 它们可以在房间中很方便地组合出各种静态物品，如地形，墙壁，背景等，并且它们不需要物体那么多的系统资源。

source: They are listed below:
zh_cn: 列出如下：

source: They are only valid for the session that they were created in.
zh_cn: 它们仅对所创建的会话有效。

source: They are:
zh_cn: 选项有：

source: They can be given behaviours and they can react to certain events as well as to each other, and most of the things you see in a game are based on objects and their interactions.
zh_cn: 他们可以给予行为和对某些事件做出反应以及彼此,和你在游戏看到的大多数事情都是基于物体和他们的相互作用。

source: They provide an overview of how GameMaker Studio 2 works and what you should expect to find when you first start using it to make your games.
zh_cn: 它们提供了 GameMaker Studio 2 如何工作的概述以及当你第一次使用它做游戏时你应该干什么。

source: Things like the room size, the camera view ports that are active and a few other things can be set here.
zh_cn: 房间也有一些属性，可以在这里设置，像房间大小，活动的摄像头视图端口和其他等等。

source: Think of it as an extra dimension to our container, as it now has height and width whereas the 1D array only has height.
zh_cn: 想象它是容器的另外一个维度，一个高度 和 一个宽度，而一维数组只有高度。

source: This read-only variable returns the number of "arguments" that are passed through to a script.
zh_cn: 该只读变量返回传递给脚本的参数个数。

source: This read-only variable returns the type of event currently being executed, which can be one of the following constants:
zh_cn: 该只读 变量返回当前正被执行的事件类型，其可能为如下常量：

source: This Debug Bar shows in a helpful graphic of CPU/GPU usage in the actual game window itself, and this can be toggled on and off in your game using the function show_debug_overlay().
zh_cn: 此调试条在实际的游戏窗口中显示了 CPU / GPU 使用情况的帮助图示，并且可以使用函数 show_debug_overlay() 在游戏中切换开关。

source: This ID can then be used to cancel the notification using the function push_cancel_local_notification().
zh_cn: 使用这个ID可以通过调用push_cancel_local_notification()来取消通知。

source: This Windows only function can be used to change the vertical synchronisation method at runtime.
zh_cn: 这个只用于 Windows 的函数可以用于在运行时改变垂直同步方法。

source: This Windows only function can be used to get the current vertical synchronisation method at runtime.
zh_cn: 这个只用于 Windows 的函数在运行时获取当前垂直同步的方法。

source: This Windows only function permits you to choose one of various different ways of handling the game geometry vertex buffer, some of which may work better on different machines.
zh_cn: 这个只用于 Windows 的函数允许你选择多个不同的处理游戏几何顶点缓冲区的方法中的一个，它们中的一些在不同的机器上可能表现得更好。

source: This Windows only function permits you to find out the current method for handling the game geometry vertex buffer.
zh_cn: 这个只用于 Windows 的函数，允许你找出当前处理游戏几何顶点缓冲区的方法。

source: This account holds all your licence details for the YoYo Games products that you own, and is also used for the YoYo Games Marketplace.
zh_cn: 你的账户承载着你的所拥有的全部YoYo Games产品的许可信息并且也被用于YoYo Games 市场。

source: This action has no layout.
zh_cn: 这个动作没有布局。

source: This addon requires the Amazon Fire or Mobile licences.\nDo you want to go to your account to check your availability of these?
zh_cn: 此附加组件需要 Amazon Fire 或 移动版本(Mobile) 许可证。\n您是否要转到您的帐户检查这些的可用性？

source: This adds up, especially if you're doing a tight loop with lots of calculations like this.
zh_cn: 当这些情况加起来，特别是你在对一个像这样很紧张的，带有很多运算的循环当中的时候。

source: This array can then be passed through to scripts and functions on a pass-by-reference basis, however should you modify the passed array, it will then become a copy of the original array and so will need to be returned back to the original variable for the array to be updated.
zh_cn: 通过传引用（Pass-by-reference）可以将这个数组传递给脚本或函数中，但是当你要修改所传递的数组的时候，它会变成原来数组的一个拷贝（Copy），因此你需要回到原来需要修改的数组中。

source: This asset hasn't received enough reviews yet.
zh_cn: 这个资源还没有收到足够的评论。

source: This avoids the need to do a floating point divide, and then a floor( ) calculation – which all adds up.
zh_cn: 这很好地避免了使用浮点数除法然后再用 floor() 向下取整计算一起进行的必要。

source: This bar is split into sections, with each section being 1/60th of a second.
zh_cn: 这个显示栏被分成几个部分，每个部分代表 1/60 秒。

source: This button can be used to cancel the compilation of your games to the target module, or (on certain targets only) to stop the game while it is running after it has been compiled.
zh_cn: 此按钮可用于取消您的游戏编译到目标模块，或在游戏编译完毕后停止运行游戏（仅限某些目标）。

source: This can be a general search, or you can make it case sensitive or look for the whole word only.
zh_cn: 你可以进行常规搜索，你也可以使其 区分大小写 或使用 整词查找。

source: This can be a global or instance scope variable, a built in variable or even an array or data structure.
zh_cn: 追踪的内容可以是一个全局或实例范围的变量，一个内置的变量，甚至数组或数据结构。

source: This can be a positive or negative value from -128 to 127 (0 is classed as positive).
zh_cn: 值域为-128到127的正值和负值（0被归类为正值）。

source: This can be faster than first finding the resource in the list of resources and then indicating you want to edit it.
zh_cn: 这比首先在资源列表中查找资源然后再进行编辑资源可能要快。

source: This can be found in the Program Data folder of your Windows OS (this may be hidden by deafult so you will need to change the viewing properties to see it), with a typical format like this:
zh_cn: Runner 可以在 Windows 操作系统的 Program Data 文件夹找到（该文件夹默认隐藏，所以你需要更改查看属性才能看见它），典型的格式如下：

source: This can be set in the Global Game Settings Windows tab or with the function display_set_windows_vertex_buffer_method(), and will return one of the following constants:
zh_cn: 这个可以在全局游戏设定中或者使用函数 display_set_windows_vertex_buffer_method()设置，然后返回下面的一个常量：

source: This can be set in the Global Game Settings Windows tab too, and will affect performance to different degrees depending on the machine.
zh_cn: 这个可也可以在全局游戏设定的 Windows 选项卡中设置，根据不同的机器将会有不同的性能表现。

source: This can be used to test whether a saved window position is going to be visible or not (the user may have disconnected an external monitor or moved the window off screen which left the window position that was saved as not being valid), for example.
zh_cn: 这个可以用来测试是否一个保存的窗口位置即将显示或隐藏（用户可能已经断开与外部监视器的连接，或者窗口移出了屏幕，造成了窗口位置保存的是一个无效值），比如下面的例子。

source: This can be very useful for memory allocation, or making sure you write data to proper boundaries.In this example, argument0 needs to be aligned to argument1 bytes, where argument1 is a power of 2 number.
zh_cn: 这对于内存分配或确保将数据写入适当的边界非常有用。在本例中，argument0 需要与 argument1 字节对齐，其中 argument1 是 2 的次方数。

source: This can be very useful to avoid typing out the same code multiple times, or for using arrays, or for counting through a number of operations etc...
zh_cn: 这对于规避键入多次相同的代码、或者使用数组、又或者一些操作中的计数等等是非常有效的。

source: This can increase your games performance by at least two or three times, especially on logic-heavy games, ideal for those larger or CPU intensive games.
zh_cn: 这可以将您的游戏性能提高至少两到三倍，特别是对于重量级游戏以及较大型或者对CPU使用程度较高的游戏来说效果非常理想。

source: This can now be used as follows in another event of the controller object (an alarm for example, or a key press event):
zh_cn: 下面的代码可以在控制器的另外一个事件中使用（比如计时器，或者按键事件）。

source: This caption appears at the top of the window, beside the game icon, when the game is not in full screen mode.
zh_cn: 当游戏不是全屏模式，标题出现在窗口顶部游戏图标的旁边。

source: This child only has 2 events defined, but it will inherit the events of the parent and so have 5, exactly the same.
zh_cn: 这个孩子只定义了2个事件，但它会继承父进程的事件，所以有5个完全一样。

source: This colour represents that which will be used for those areas of the game window that are not occupied by any views.
zh_cn: 这个颜色表示的游戏窗口内视野间隙的背景颜色。

source: This constant indicates that the pointer is not pointing to anything meaningful (the same as NULL in C++ or null in C#)
zh_cn: 该常量表示指针没有指向一个地址（空地址）（和C++中的NULL或C#中的null一样）

source: This constant simply means that the value is not a valid pointer
zh_cn: 该常量表示该值不是一个有效的指针。

source: This converse is true and if you drag certain windows to the sides of the workspace (or the bottom) then they will be docked, meaning that it essentially becomes part of the IDE window overlay and is no longer independent.
zh_cn: 相反，如果您将某些窗口拖动到工作区的两侧或底部，那么它们将会停靠，这意味着它们成为IDE 窗口的一部分，不再独立。

source: This default value is 2000ms.
zh_cn: 默认值是2000毫秒。

source: This depth is incremented by the amount given here.
zh_cn: 深度的增加量根据上面给定的的值来确定。

source: This document is divided into three parts with the aim of getting you introduced to the interface and basic workings of GameMaker Studio 2 before going on to more advanced usage and the functions available through our propriety scripting language GML or our visual scripting tool Drag and Drop.
zh_cn: 本文档分为三个部分，目的是让你熟悉GameMaker Studio 2界面和基本的工作方式，然后是高级的用法和适合我们的脚本语言GML的函数用法，或者虚拟的脚本工具拖拽（Drag and Drop，简称DnD）。

source: This does not mean however that you should be checking 1 and 0 (or any other real number) for true and false, as you are also provided with the constants true and false which should always be used in your code to prevent any issues should real boolean data types be added in a future update.
zh_cn: 然而，这也不意味着你应该使用1或0（或者别的实数）来进行检测真假，因此还提供了常量true和false，你应该总是使用它们以防止在未来的更新中引入真正的布尔数据类型时可能引发的问题。

source: This error is usually only found from trying to run a malformed project file (if this happens consistently you may wish to contact YoYo Games Support and supply the details that the compiler output window shows)
zh_cn: 通常只有在尝试运行格式错误的项目文件时才会发现此错误（如果经常发生此情况你可联系 YoYo Games Support 并提供编译器输出窗口的详细信息）

source: This event happens when an instance of the object is first created, and is the very first thing that happens within an instance that has been placed in the room through the room editor when a room is entered.
zh_cn: 当一个物体的实例第一次被创建时，这个事件就会发生，并且是在进入房间时通过房间编辑器放置在房间中的实例发生的第一件事情。

source: This event is the very last event to be executed when an instance is destroyed.
zh_cn: 此事件是一个实例被销毁时所执行的最后一个事件。

source: This extension has no exported functions
zh_cn: 该扩展没有导出的函数

source: This extremely useful for doing repetitive tasks that would involve multiple lines of code in any other way, and is commonly used as a counter for evaluating arrays, or drawing things.
zh_cn: 处理包含很多行代码的重复任务极其 有用，通常用来数组计数，或者绘制。

source: This feature only works when the function has been selected from the autocomplete.
zh_cn: 这个特性只有在自动补全开启时才有效。

source: This feed will then be scanned for updates to the runtime tools which can then be downloaded and installed.
zh_cn: 这个下载源将扫描更新运行库，然后可以下载并安装。

source: This font is missing one or more symbols and will get replacements from other fonts.
zh_cn: 此字体缺少一个或多个符号，将从其他字体中获取替换。

source: This function Resets the display settings to the ones that were set when the game was started, but also allows you to change the current level of full screen anti-aliasing being used and whether to use vertical synchronisation.
zh_cn: 这个函数将游戏开始时显示器的一些设置重置为某些值，也允许更改全屏抗锯齿的等级以及是否使用垂直同步。

source: This function allows you to attach a surface to a canvas element that already exists in your web page, meaning that you can effectively split up portions of your game to be drawn at various different places within the page.
zh_cn: 这个函数允许你为已经存在网页上的canvas元素附著一个表面图层，意味着可以有效的分割游戏的部分页面，绘制到页面内的不同地方。

source: This function can be used to add a given value (real or string) to all the values of the cells found within the defined area of a grid.
zh_cn: 这个函数可以被用于向一个栅格中一个确定区域内所有单元格的数值中叠加一个被给定的值（实数或字符串）。

source: This function can be used to add a given value (real or string) to all the values of the cells found within the defined disk area of a grid.
zh_cn: 这个函数可以被用于向一个栅格中一个确定圆盘区域内所有单元格的数值中叠加一个被给定的值（实数或字符串）。

source: This function can be used to add a given value (real or string) to the value of the given cell within the grid.
zh_cn: 这个函数可以被用于向一个栅格的被给定单元格的值叠加一个给定的值（实数或字符串）

source: This function can be used to clear a given ds_grid to a specific value.
zh_cn: 这个函数可以被用于用一个特定的数值清空一个被给定的栅格结构。

source: This function can be used to clear the entire screen (with no alpha blend) to the given colour, and is only for use in the draw event of an instance (it will not show if used in any other event).
zh_cn: 这个函数用指定颜色来填充（清空）整个屏幕（没有透明度设定），它仅能用于实例的draw事件（用于其它事件时不发挥作用）。

source: This function can be used to clear the entire screen with a given colour and the alpha component of the destination is set to the value you have set - this function does not do any blending as it works but any subsequent blend operations can be set up to use the destination alpha that you have set.
zh_cn: 这个函数可以用指定的颜色和透明度填充整个屏幕，屏幕原有图像的透明度保持不变 - 这个函数 不 会对原有图像的透明度与混合模式做任何修改。随后你可以再次修改其混合操作。

source: This function can be used to get the colour of a specific pixel from a surface, using the local coordinates of the surface where (0,0) is the top left corner.
zh_cn: 此函数使用局部坐标，可用于从一个表面获取特定像素的颜色，其中（0,0）是表面层的左上角。

source: This function can be used to maximise the GUI layer and set it to be scaled and offset in relation to the screen dimensions, rather than the default application surface position and dimensions.
zh_cn: 这个函数最大化GUI层，相对于屏幕尺寸进行缩放和偏移设置，而不是相对于默认的应用表面层的位置和尺寸。

source: This function can be used to set a local notification to be shown on a given date at a given time.
zh_cn: 此函数用于设置一个给定时间日期的本地通知。

source: This function can be used to set a maximum window height for your game.
zh_cn: 这个函数可以给游戏设置一个窗口的最大高度。

source: This function can be used to set a maximum window width for your game.
zh_cn: 这个函数可以给游戏设置一个窗口的最大宽度。.

source: This function can be used to set a minimum window height for your game.
zh_cn: 这个函数可以给游戏设置一个窗口的最小高度。

source: This function can be used to set a minimum window width for your game.
zh_cn: 这个函数可以给你的游戏设置一个最小窗口宽度。

source: This function can set the background colour of the game window.
zh_cn: 这个函数可以设置游戏窗口的背景颜色。

source: This function cancel the given push notification.
zh_cn: 这个函数将会取消已有的推送通知。

source: This function clears the matrix stack.
zh_cn: 该函数会清空矩阵栈。

source: This function has no effect on any other device.
zh_cn: 这个函数对移动设备无效。

source: This function is essential when working with surfaces due to their volatile nature.
zh_cn: 由于表面图层的不稳定性，在使用到表面时，这个函数还是有必要的。

source: This function is used to create a surface and will return the index of the surface which should be stored in a variable for future function calls.
zh_cn: 这个函数被用来创建一个表面图层，而且将会返回这个表面的索引地址，这个索引应该储存在一个变量上，将来可以调用它。

source: This function returns a special pointer for the surface texture.
zh_cn: 这个函数返回表面层纹理的特殊 指针 。

source: This function returns the amount of blue used to make the given colour, with the value being between 0 and 255, where 0 is no blue and 255 is all blue.
zh_cn: 这个函数返回给定颜色的蓝色值，这个值在0到255之间，0代表不含有蓝色，255代表100%的蓝色。

source: This function returns the amount of green used to make the given colour, with the value being between 0 and 255, where 0 is no green and 255 is all green.
zh_cn: 这个函数返回给定颜色的绿色值，这个值在0到255之间，0代表不含有绿色，255代表100%的绿色。.

source: This function returns the amount of red used to make the given colour, with the value being between 0 and 255, where 0 is no red and 255 is all red.
zh_cn: 这个函数返回给定颜色的红色值，这个值在0到255之间，0代表不含有红色，255代表100%的红色。

source: This function returns the background colour of the game window.
zh_cn: 这个函数返回游戏窗口的背景颜色。

source: This function returns the caption of the window (this is the text that appears on the top of the window, beside its icon) and by default this shows the caption of the room you're currently in.
zh_cn: 此函数返回窗口的标题（窗口顶部图标旁边出现的标题文字），默认显示的是当前房间的标题。

source: This function returns the current value of the draw alpha, which will range between 0 (fully transparent) and 1 (fully opaque).
zh_cn: 这个函数返回当前的绘制透明度值，这个数值的范围是从0（完全透明）到1（完全不透明）。

source: This function returns the direction of a vector formed by the specified components [x1,y1] and [x2,y2] in relation to the fixed x/y coordinates of the room.
zh_cn: 这个函数返回由特定的相对于房间的x/y坐标组件(x1,y1)和(x2,y2)形成的一个向量的方向。

source: This function returns whether an object with the specified index exists or not.
zh_cn: 该函数返回指定索引的物体是否存在。

source: This function returns whether the game window is in fullscreen mode (true) or not (false).
zh_cn: 这个函数返回游戏窗口是否是全屏模式(为真)，或者不是 (为假)。

source: This function sets the angular damping value of a fixture.
zh_cn: 这个函数 sets the angular damping value of a fixture.

source: This function simply takes the image from one surface and copies it onto another one at the specified local position within that surface (where the (0,0) position is the top left corner of the destination surface).
zh_cn: 这个函数简单的让图像从一个表面图层复制到另外一个表面特殊的位置（(0,0)表示在表面图层的左上角）。

source: This function will commit a file to the chosen cloud service for storage.
zh_cn: 这个函数将提交一个文件到所选云服务用于存储。

source: This function will commit a string to the chosen cloud service for storage.
zh_cn: 该函数将提交一个字符串到所选的云服务用于存储。

source: This function will get the dpi of the device display along the x axis (this value is also dependant on the orientation of the device).
zh_cn: 这个函数将获取设置显示器x轴的dpi（这个值也依赖设备的方向）。

source: This function will get the dpi of the device display along the y axis (this value is also dependant on the orientation of the device).
zh_cn: 这个函数将获取设置显示器y轴的dpi（这个值也依赖设备的方向）。

source: This function will only affect things drawn in the Draw GUI Event and can be used to set a specific width and height for all GUI components in that event, and no matter what size of display or window is used to display the GUI, it will be scaled to fit correctly.
zh_cn: 此函数只会影响 Draw GUI Event 中的绘制的内容，并可以用来给那个事件中所有GUI组件设定特定的宽度和高度， 不管显示器或窗口之前是怎样显示GUI，都会缩放到适当的效果。

source: This function will populate a pre-made ds_map with a series of key/value pairs for the first local push notification in the queue to be shown.
zh_cn: 这个函数将以一系列键值对儿（key/value pairs）的形式返回一个 ds_map作为本地通知队列中最先被显示的通知。

source: This function will populate a pre-made ds_map with a series of key/value pairs for the next local push notification in the queue to be shown.
zh_cn: 这个函数以一系列键值对儿（key/value pairs）的形式返回一个 ds_map 作为本地通知队列中下一个被显示的通知。

source: This function will resize a surface to the given dimensions (in pixels).
zh_cn: 这个函数将重置表面的大小为给定的长宽值（像素）。

source: This function will return true if the application surface is being used for drawing, or false if the screen buffer is being used.
zh_cn: 如果使用应用表面层，这个函数将返回 真 ， 或者如果使用屏幕缓存区返回 假。

source: This function will return the IP address of the given URL.
zh_cn: 该函数将会返回指定URL的IP地址。

source: This function will return the height of the display (in pixels).
zh_cn: 这个函数将返回显示器的高度（像素为单位）。

source: This function will return the hue of the given colour.
zh_cn: 这个函数将返回给定颜色的色相。

source: This function will return the mouse x position relative to the view selected.
zh_cn: 这个函数将返回相对于所选视野的鼠标x坐标。

source: This function will return the mouse x position within the screen.
zh_cn: 这个函数返回 屏幕上鼠标指针的x坐标。

source: This function will return the mouse y position relative to the view selected.
zh_cn: 这个函数将返回相对于所选视野的鼠标y坐标。

source: This function will return the mouse y position within the screen.
zh_cn: 这个函数返回 屏幕鼠标位置的x坐标。

source: This function will return the saturation of the given colour.
zh_cn: 这个函数将返回给定颜色的饱和度。

source: This function will return the smallest angle difference between two angles as a value between -180 and 180 degrees (where a positive angle is anti-clockwise and a negative angle clockwise).
zh_cn: 这个函数将会返回两个角的最小角度差.

source: This function will return the value (luminosity) of the given colour.
zh_cn: 这个函数将返回给定颜色的明度。

source: This function will return the width of the display (in pixels).
zh_cn: 这个函数将返回显示器的宽度（以像素为单位）。

source: This function will save a part of a surface to disc using the given filename.
zh_cn: 此函数将使用给定的文件名保存表面层到硬盘上。

source: This function will save a surface to disc using the given filename.
zh_cn: 此函数将使用给定的文件名保存表面层到硬盘上。

source: This function will send off to the cloud for data, which will then trigger the appropriate asynchronous event.
zh_cn: 这个函数用于向云端发送数据, 并触发相应的异步事件。

source: This function will tell you whether the object you are checking has been flagged as "physics enabled", returning true, or not, returning false.
zh_cn: 该函数会告诉你所检查的物体是否被标记为“启用物理的物体”，若是则返回true否则返回false。

source: This function would be called in an event like the Game Start Event or in an object that is placed in the first room of your game, with the idea being that you check the current data blob from the cloud server to see if it is up to date or not.
zh_cn: 这个函数会在 开始事件（Game Start Event） 或者当一个 object 被放置在你的游戏的第一个房间中时被调用，通过这种思路来从云端服务器检查是否有数据更新。

source: This function would normally be called at the start of a new game and is used to retrieve the current status of the cloud service at game start up.
zh_cn: 这个函数通常在新的游戏的开始被调用，用于检索云端服务器上存储的游戏的启动。

source: This general draw event will be caled, like the step event, every game frame, but it works in two different ways.
zh_cn: 这个普通绘图事件和步骤事件一样，每一个游戏帧都会被检测和触发，但是它有两种不同的工作方式。

source: This global scope, built-in variable can be used to access the application surface using any of the surface functions.
zh_cn: 在全局的范围内，这个内置变量可以访问应用表面层，任何表面层函数都可以使用它。

source: This graph shows frames per second and memory usage over time.\nHold Control and scroll to expand and contract the graph.
zh_cn: 此图显示每秒帧数和随时间的内存使用情况。\n按住Control并滚动以展开和收缩图形。

source: This graph shows frames per second and memory usage over time.\nHold ⌘ and scroll to expand and contract the graph.
zh_cn: 此图显示每秒帧数和随时间变化的内存使用情况。\n按住⌘并滚动以展开和收缩图形。

source: This group is empty.
zh_cn: 该组为空。

source: This happens when, in an action, you indicate that the action must be applied to instances of a certain object.
zh_cn: 当在一个动作中，您指出该操作必须应用于某个对象的实例时，会发生这种情况。
